# **1  Reading Files**

In [ ]:
# importing libraries
import pandas as pd

In [ ]:
#importing data
data = pd.read_csv('churn_prediction.csv')

In [ ]:
#first 5 instances using "head()" function
data.head()

   customer_id  vintage  age  ... previous_month_balance  churn last_transaction
0            1     2101   66  ...                1458.71      0       2019-05-21
1            2     2348   35  ...                8787.61      0       2019-11-01
2            4     2194   31  ...                5070.14      0              NaT
3            5     2329   90  ...                1669.79      1       2019-08-06
4            6     1579   42  ...                1677.16      1       2019-11-03

[5 rows x 21 columns]

In [ ]:
#last 5 instances using "tail()" function
data.tail()

       customer_id  vintage  ...  churn last_transaction
28377        30297     2325  ...      0       2019-10-22
28378        30298     1537  ...      0       2019-12-17
28379        30299     2376  ...      1       2019-12-31
28380        30300     1745  ...      0              NaT
28381        30301     1175  ...      1       2019-11-02

[5 rows x 21 columns]

In [ ]:
#finding out the shape of the data using "shape" variable: Output (rows, columns)
data.shape

(28382, 21)

In [ ]:
#Printing all the columns present in data
data.columns

Index(['customer_id', 'vintage', 'age', 'gender', 'dependents', 'occupation',
       'city', 'customer_nw_category', 'branch_code', 'current_balance',
       'previous_month_end_balance', 'average_monthly_balance_prevQ',
       'average_monthly_balance_prevQ2', 'current_month_credit',
       'previous_month_credit', 'current_month_debit', 'previous_month_debit',
       'current_month_balance', 'previous_month_balance', 'churn',
       'last_transaction'],
      dtype='object')

# **1.2  Variable Identification and Typecasting**

In [ ]:
# A closer look at the data types present in the data
data.dtypes

customer_id                         int64
vintage                             int64
age                                 int64
gender                             object
dependents                        float64
occupation                         object
city                              float64
customer_nw_category                int64
branch_code                         int64
current_balance                   float64
previous_month_end_balance        float64
average_monthly_balance_prevQ     float64
average_monthly_balance_prevQ2    float64
current_month_credit              float64
previous_month_credit             float64
current_month_debit               float64
previous_month_debit              float64
current_month_balance             float64
previous_month_balance            float64
churn                               int64
last_transaction                   object
dtype: object

There are a lot of variables visible at one, so let's narrow this down by looking at one datatype at once. We will start with int

# **1.2.1  Integer Data Type**

In [ ]:
# Identifying variables with integer datatype
data.dtypes[data.dtypes == 'int64']

customer_id             int64
vintage                 int64
age                     int64
customer_nw_category    int64
branch_code             int64
churn                   int64
dtype: object

Summary:

**Customer id** are a unique number assigned to customers. It is are O**kay as Integer.**

**branch code** again represents different branches, therefore it should be **convereted to category. **

**Age and Vintage** are also numbers and hence we are okay with them as integers.

**customer_networth_category** is supposed to be an ordinal category, **should be converted to category.**

**churn** : 1 represents the churn and 0 represents not churn. However, there is no comparison between these two categories. This **needs to be converted to category datatype.**

In [ ]:
# converting churn to category
data['churn'] = data['churn'].astype('category')
data['branch_code'] = data['branch_code'].astype('category')
data['customer_nw_category'] = data['customer_nw_category'].astype('category')
data.dtypes[data.dtypes == 'int64']

customer_id    int64
vintage        int64
age            int64
dtype: object

# **1.2.2  Float Data Type**

In [ ]:
# Identifying variables with float datatype
data.dtypes[data.dtypes == 'float64']

dependents                        float64
city                              float64
current_balance                   float64
previous_month_end_balance        float64
average_monthly_balance_prevQ     float64
average_monthly_balance_prevQ2    float64
current_month_credit              float64
previous_month_credit             float64
current_month_debit               float64
previous_month_debit              float64
current_month_balance             float64
previous_month_balance            float64
dtype: object

Summary:

**dependents** is expected to be a whole number. **Should be changed to integer type**

**city** variable is also a unique code of a city represented by some interger number. **Should be converted to Category type**

Rest of the variables like **credit, balance and debit** are best represented by the float variables.

In [ ]:
# converting "dependents" and "city" to their respective types
data['dependents'] = data['dependents'].astype('Int64')
data['city'] = data['city'].astype('category')

# checking
data[['dependents','city']].dtypes

dependents       Int64
city          category
dtype: object

# **1.2.3  Object Data Type**

In [ ]:
data.dtypes

customer_id                          int64
vintage                              int64
age                                  int64
gender                              object
dependents                           Int64
occupation                          object
city                              category
customer_nw_category              category
branch_code                       category
current_balance                    float64
previous_month_end_balance         float64
average_monthly_balance_prevQ      float64
average_monthly_balance_prevQ2     float64
current_month_credit               float64
previous_month_credit              float64
current_month_debit                float64
previous_month_debit               float64
current_month_balance              float64
previous_month_balance             float64
churn                             category
last_transaction                    object
dtype: object

**variables like 'gender', 'occupation' and 'last_transaction' are of type object**. This means that** Pandas was not able to recognise the datatype** of these three variables.

In [ ]:
# Manually checking object types
data[['gender','occupation','last_transaction']].head(7)

   gender     occupation last_transaction
0    Male  self_employed       2019-05-21
1    Male  self_employed       2019-11-01
2    Male       salaried              NaT
3     NaN  self_employed       2019-08-06
4    Male  self_employed       2019-11-03
5  Female  self_employed       2019-11-01
6    Male        retired       2019-09-24

**gender and occupation** variables **belong to categorical data types**.

**last_transaction** should be a **datetime variable**.

In [ ]:
# typecasting "gender" and "occupation" to category type
data['gender'] = data['gender'].astype('category')
data['occupation'] = data['occupation'].astype('category')

# checking
data[['gender','occupation']].dtypes

gender        category
occupation    category
dtype: object

# **1.2.4  datetime Data Type**

In [ ]:
# creating an instance(date) of DatetimeIndex class using "last_transaction"
date = pd.DatetimeIndex(data['last_transaction'])

In [ ]:
# extracting new columns from "last_transaction"

# last day of year when transaction was done
data['doy_ls_tran'] = date.dayofyear

# week of year when last transaction was done
data['woy_ls_tran'] = date.weekofyear

# month of year when last transaction was done
data['moy_ls_tran'] = date.month

# day of week when last transaction was done
data['dow_ls_tran'] = date.dayofweek

In [ ]:
# checking new extracted columns using datetime
data[['last_transaction','doy_ls_tran','woy_ls_tran','moy_ls_tran','dow_ls_tran']].head()

  last_transaction  doy_ls_tran  woy_ls_tran  moy_ls_tran  dow_ls_tran
0       2019-05-21        141.0         21.0          5.0          1.0
1       2019-11-01        305.0         44.0         11.0          4.0
2              NaT          NaN          NaN          NaN          NaN
3       2019-08-06        218.0         32.0          8.0          1.0
4       2019-11-03        307.0         44.0         11.0          6.0

The first column is the complete date of the last transaction which was done by the any given customer.

The next columns represent the day of year, week of year, month of year, day of week when the last transaction was done.

**Breaking down the date variable** into these granular information will **help us in understand when the last transaction was done from different perspectives**. Now that we have extracted the essentials from the last_transaction variables, we will drop it from the dataset.

In [ ]:
data = data.drop(columns = ['last_transaction'])
data.dtypes

customer_id                          int64
vintage                              int64
age                                  int64
gender                            category
dependents                           Int64
occupation                        category
city                              category
customer_nw_category              category
branch_code                       category
current_balance                    float64
previous_month_end_balance         float64
average_monthly_balance_prevQ      float64
average_monthly_balance_prevQ2     float64
current_month_credit               float64
previous_month_credit              float64
current_month_debit                float64
previous_month_debit               float64
current_month_balance              float64
previous_month_balance             float64
churn                             category
doy_ls_tran                        float64
woy_ls_tran                        float64
moy_ls_tran                        float64
dow_ls_tran                        float64
dtype: object